// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "蕊蕊小同学", 
        "在這特別的日子", 
        "在海淀送上最近的祝福", 
        "生日快乐呀！", //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "愿你下雨時身邊有傘",  // 同上...
        "愿你每次跑圖都炸花",
        "愿你抬头便有美麗的天空",
        "愿你烤的每一片吐司都剛剛好",
        "愿你在繁星中抓住最鍾意的那顆",
        "愿你嘗試的美食比想像中更好吃",
        "愿你在換季的衣服裡發現零錢",
        "愿你做過的美夢都不會忘記",
        "愿你永遠平安喜樂美麗動人",
        "在每一个瞬間感到幸福",
        "即使時光流转",
        "那份心情卻不會改变",
        "期待你白眼每一天❤",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"在遠方送上最近的祝福": "./imgs/1.png",
        //"愿你下雨時身邊有傘": "./imgs/2.png",  
        //"愿你每次跑圖都炸花": "./imgs/3.png",
        //"愿你抬頭便有美麗的天空": "./imgs/4.png",
        //"愿你烤的每一片土司都剛剛好": "./imgs/5.png",
        //"愿你在繁星中抓住最鍾意的那顆": "./imgs/6.png",
        //"愿你嘗試的美食比想像中更好吃": "./imgs/7.png",
        //"愿你在換季的衣服裡發現零錢": "./imgs/8.png",
        //"愿你做過的美夢都不會忘記": "./imgs/9.png",
        //"愿你永遠平安喜樂美麗動人": "./imgs/10.png",

        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "横幅~",
        balloons_flying: "好像少一些東西...",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快樂！",
        story: "SOME MESSAGE FOR YOU",
    }
};
